000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДанныеКредитныхПрограмм/ДанныеКредитныхПрограмм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеКредитныхПрограмм</name>
  <resources>
    <name>УслугаБанка</name>
    <type>
      <types>CatalogRef.УслугиБанка</types>
    </type>
  </resources>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Интеграция</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <comment>УИ без символов &quot;-&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </resources>
  <resources>
    <name>УслугаБанкаПериодПредоставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКредитаВозврат</name>
    <comment>Сумма, опредённая при возврате товаров от покупателя</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГарантийноеПисьмоДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийноеПисьмоПодтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаОформлениеКредита</types>
    </type>
  </resources>
  <resources>
    <name>ОтветБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеВозвратов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторБанкаВозврата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВозврата</name>
    <comment>УИ без символов &quot;-&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтветБанкаВозврат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВозврата</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаОформлениеКредита</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СчетНаОплатуПокупателю</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДанныеКредитныхПрограмм/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТолькоПросмотр = ТолькоПросмотр();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	УстановитьОформлениеЭлементов();

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ТекущаяСтраница.Имя = "СтраницаГарантийноеПисьмо" Тогда

		УстановитьТекстГарантийногоПисьма();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьТекстГарантийногоПисьма()

	ГарантийноеПисьмо = "";

	МенеджерЗаписи = РегистрыСведений.ДанныеКредитныхПрограмм.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СчетНаОплатуПокупателю = Запись.СчетНаОплатуПокупателю;
	МенеджерЗаписи.УслугаБанка = Запись.УслугаБанка;

	МенеджерЗаписи.Прочитать();

	ДанныеПисьма = МенеджерЗаписи.ГарантийноеПисьмоДанные.Получить();

	Если ТипЗнч(ДанныеПисьма) = Тип("Структура") Тогда

		ГарантийноеПисьмо = ОбщегоНазначенияКлиентСервер.СтруктураПредставление("Данные гарантийного письма", ДанныеПисьма);

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТолькоПросмотр()

	Возврат НЕ (РольДоступна(Метаданные.Роли.АдминистраторСистемы) И ТехническаяПоддержкаВызовСервера.ИсключительныйРежим());

КонецФункции

&НаСервере
Процедура КомандаУстановитьСсылкуДокументПродажиНаСервере()

	Если НЕ ЗначениеЗаполнено(Запись.ДокументПродажи) Тогда

		Запись.ДокументПродажи = Документы.ЧекККМ.ПолучитьСсылку();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСсылкуДокументПродажи(Команда)

	КомандаУстановитьСсылкуДокументПродажиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеЭлементов()

	Элементы.КомандаУстановитьСсылкуДокументПродажи.Доступность = НЕ ЗначениеЗаполнено(Запись.ДокументПродажи);

КонецПроцедуры
